'use strict' 

function map(a,  b, c) {

	var a = prompt("Введите параметр а", '');
	var b = prompt("Введите параметр b", '');
	var c = prompt("Введите параметр c", '');
    var result = '';
     
	var x1, x2, D;
	 b*b - 4*a*c;
    if (D < 0) {
    	result = 'Данное уравнение не имеет корней';
    	alert(result)
    }
    if (D = 0) {
    	result = 
    	alert()
    }
    if (D > 0) {
    	result =
    }

}

Функция расчета кинетической энергии тела 
расчета площади прямоугольника, круга, овала
расчет расстояния от одной точки до другой


сумму прибыли ( просуммировать массив прибыли)
массив с числами , в котором лежит прибь
и числа в массиве сложить


функция findIndexOf
 индекс элемента (есть поередлённое айпи которое можно псмотреть в интернете)
7 


функция, которая находит последний элемент массива
(должно возвращать индекс последнего элемента)
array IndexOf 
первім єлементом в функцию заходит массив, которій будет искаться


arrayslice


посчитать за сколько секунд упадет тело с высоты х (метров) на землю 

+ map и квадратное уравнение
